from ReformatPDF import ReformatPDF

pdf = ReformatPDF()
pdf.translate(pdf_name='PDF/Информация о ходе приёма заявлений в ДГТУ на контрактной основе. Очно-заочная форма обучения.pdf',
              new_json_name='JSON/Информация о ходе приёма заявлений в ДГТУ на контрактной основе. Очно-заочная форма обучения.json',
              delete_temp=True)

pdf.translate(pdf_name='PDF/Информация о ходе приёма заявлений в ДГТУ на бюджетной основе. Очная форма обучения.pdf',
              new_json_name='JSON/Информация о ходе приёма заявлений в ДГТУ на бюджетной основе. Очная форма обучения.json',
              delete_temp=True)

pdf.translate(pdf_name='PDF/Информация о ходе приёма заявлений в ДГТУ на бюджетной основе. Заочная форма обучения.pdf',
              new_json_name='JSON/Информация о ходе приёма заявлений в ДГТУ на бюджетной основе. Заочная форма обучения.json',
              delete_temp=True)

pdf.translate(pdf_name='PDF/Информация о ходе приёма заявлений в ДГТУ на бюджетной основе. Заочная форма обучения.pdf',
              new_json_name='JSON/Информация о ходе приёма заявлений в ДГТУ на бюджетной основе. Заочная форма обучения.json',
              delete_temp=True)

pdf.translate(pdf_name='PDF/Копия_01_08_Информация_о_ходе_приёма_заявлений_в_ДГТУ_на_бюджетной.pdf',
              new_json_name='JSON/Копия_01_08_Информация_о_ходе_приёма_заявлений_в_ДГТУ_на_бюджетной.json',
              delete_temp=True)
